metaneutrons/Vellum/firmware-d1001/components/esp32_p4_re_terminal_d1001/src/esp32_p4_re_terminal_d1001.c
/*
 * SPDX-FileCopyrightText: 2024 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include "sdkconfig.h"
#include "driver/gpio.h"
#include "driver/ledc.h"
#include "soc/pmu_reg.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_check.h"
#include "esp_timer.h"
#include "esp_spiffs.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_mipi_dsi.h"
#include "esp_ldo_regulator.h"
#include "esp_vfs_fat.h"
#include "sd_pwr_ctrl_by_on_chip_ldo.h"

#include "esp_lcd_jd9365_8.h"
#include "esp_lcd_touch_gsl3670.h"
#include "esp_io_expander_pca9535.h"

#include "esp32_p4_re_terminal_d1001.h"
#include "display.h"
#include "touch.h"
#include "bsp_err_check.h"
#include "esp_codec_dev_defaults.h"

#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"

#include "esp_pm.h"
#include "esp_sleep.h"
#include "iot_button.h"
#include "button_gpio.h"

#include "bsp_lsm6ds3.h"
#include "bsp_pcf8563.h"

static const char *TAG = "ESP32_P4_EV";

#if (BSP_CONFIG_NO_GRAPHIC_LIB == 0)
static lv_indev_t *disp_indev = NULL;
#endif // (BSP_CONFIG_NO_GRAPHIC_LIB == 0)

sdmmc_card_t *bsp_sdcard = NULL;    // Global uSD card handler

static bool i2c_0_initialized = false;
static bool i2c_1_initialized = false;

esp_io_expander_handle_t io_expander = NULL;

#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0))
static i2c_master_bus_handle_t i2c_0_handle = NULL;  // I2C Handle
static i2c_master_bus_handle_t i2c_1_handle = NULL;  // I2C Handle
#endif

static i2s_chan_handle_t i2s_tx_chan = NULL;
static i2s_chan_handle_t i2s_rx_chan = NULL;

static const audio_codec_data_if_t *i2s_adc_data_if = NULL;
static const audio_codec_data_if_t *i2s_dac_data_if = NULL;

#define ADC_SAMPLE_NUM  16
#define AD_LOST_VAL     1
static bool adc_initialized = false;
static adc_oneshot_unit_handle_t adc_1_handle = NULL;
static int adc_raw_data[ADC_SAMPLE_NUM] = {0};
static int bsp_usb_volt = 0;
static int bsp_bat_volt = 0;
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
static adc_cali_handle_t adc_1_cali_chan_1_handle = NULL;
static adc_cali_handle_t adc_1_cali_chan_2_handle = NULL;
#endif

sd_pwr_ctrl_handle_t sd_pwr_ctrl_handle = NULL;
static bool sd_pwr_ctrl_init = false;

#define BSP_BATTERY_CHARGE_PROTECT      0
#define BSP_BATTERY_CHARGE_TEMP_MAX     43
#define BSP_BATTERY_CHARGE_TEMP_MIN     2
static TaskHandle_t battery_manage_task;
static bool battery_task_init = false;

#define CHARGE_VOLT_HIGH    4150
#define CHARGE_VOLT_LOW     3800
static bool bat_chg_state = true;

// #define BATTERY_POINT       11
// #define PERCENT_STEP_MIN    10
// static int battery_level_percent_table[BATTERY_POINT] = {3262, 3389, 3488, 3586, 3658, 3711, 3762, 3819, 3872, 3916, 4047};
#define BATTERY_POINT       21
#define PERCENT_STEP_MIN    5
static int battery_level_percent_table[BATTERY_POINT] = {3262, 3390, 3467, 3554, 3619, 3659, 3686, 3710, 3731, 3752, 
                                                        3774, 3797, 3827, 3855, 3880, 3901, 3915, 3934, 3958, 3978, 4047};

esp_lcd_panel_handle_t disp_panel = NULL;

static TaskHandle_t backlight_auto_task;
static bool backlight_task_init = false;
static bool brightness_init = false;
static bool backlight_enable = true;
static bool backlight_auto = false;
static int backlight_default = 100;

static TaskHandle_t sd_card_m_task_handle;
static bool sd_card_insert = false;
static bool sd_mount_flag = false;

static uint32_t bsp_boot_count = 0;

#define LED_GREEN_DC_DEF    8
#define LED_RED_DC_DEF      20
#define LED_BLUE_DC_DEF     50

lsm6ds3_handle_t lsm6ds3;
pcf8563_handle_t pcf8563;

/* Can be used for `i2s_std_gpio_config_t` and/or `i2s_std_config_t` initialization */
#define BSP_I2S_ADC_GPIO_CFG       \
    {                              \
        .mclk = BSP_ADC_I2S_MCLK,  \
        .bclk = BSP_ADC_I2S_SCLK,  \
        .ws = BSP_ADC_I2S_LRLK,    \
        .din = BSP_ADC_I2S_SDIN,   \
        .dout = BSP_ADC_I2S_SDOUT, \
        .invert_flags = {          \
            .mclk_inv = false,     \
            .bclk_inv = false,     \
            .ws_inv = false,       \
        },                         \
    }
#define BSP_I2S_DAC_GPIO_CFG       \
    {                              \
        .mclk = BSP_DAC_I2S_MCLK,  \
        .bclk = BSP_DAC_I2S_SCLK,  \
        .ws = BSP_DAC_I2S_LRLK,    \
        .din = BSP_DAC_I2S_SDIN,   \
        .dout = BSP_DAC_I2S_SDOUT, \
        .invert_flags = {          \
            .mclk_inv = false,     \
            .bclk_inv = false,     \
            .ws_inv = false,       \
        },                         \
    }

/* This configuration is used by default in `bsp_extra_audio_init()` */
#define BSP_I2S_ADC_DUPLEX_MONO_CFG(_sample_rate)                                                     \
    {                                                                                                   \
        .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(_sample_rate),                                            \
        .slot_cfg = I2S_STD_PHILIP_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO), \
        .gpio_cfg = BSP_I2S_ADC_GPIO_CFG,                                                               \
    }

#define BSP_I2S_DAC_DUPLEX_MONO_CFG(_sample_rate)                                                     \
    {                                                                                                   \
        .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(_sample_rate),                                            \
        .slot_cfg = I2S_STD_PHILIP_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO), \
        .gpio_cfg = BSP_I2S_DAC_GPIO_CFG,                                                               \
    }

esp_err_t bsp_i2c_0_init(void)
{
    /* I2C was initialized before */
    if (i2c_0_initialized) {
        return ESP_OK;
    }

    i2c_master_bus_config_t i2c_bus_conf = {
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .sda_io_num = BSP_I2C_0_SDA,
        .scl_io_num = BSP_I2C_0_SCL,
        .i2c_port = 0,
    };
    BSP_ERROR_CHECK_RETURN_ERR(i2c_new_master_bus(&i2c_bus_conf, &i2c_0_handle));

