metaneutrons/Vellum/firmware-d1001/components/esp32_p4_re_terminal_d1001/src/esp32_p4_re_terminal_d1001.c
    i2c_0_initialized = true;

    return ESP_OK;
}

esp_err_t bsp_i2c_0_deinit(void)
{
    BSP_ERROR_CHECK_RETURN_ERR(i2c_del_master_bus(i2c_0_handle));
    i2c_0_initialized = false;
    return ESP_OK;
}

i2c_master_bus_handle_t bsp_i2c_0_get_handle(void)
{
    return i2c_0_handle;
}

esp_err_t bsp_i2c_1_init(void)
{
    /* I2C was initialized before */
    if (i2c_1_initialized) {
        return ESP_OK;
    }

    i2c_master_bus_config_t i2c_bus_conf = {
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .sda_io_num = BSP_I2C_1_SDA,
        .scl_io_num = BSP_I2C_1_SCL,
        .i2c_port = 1,
    };
    BSP_ERROR_CHECK_RETURN_ERR(i2c_new_master_bus(&i2c_bus_conf, &i2c_1_handle));

    i2c_1_initialized = true;

    return ESP_OK;
}

esp_err_t bsp_i2c_1_deinit(void)
{
    BSP_ERROR_CHECK_RETURN_ERR(i2c_del_master_bus(i2c_1_handle));
    i2c_1_initialized = false;
    return ESP_OK;
}

i2c_master_bus_handle_t bsp_i2c_1_get_handle(void)
{
    return i2c_1_handle;
}

esp_err_t bsp_sdcard_mount(void)
{
    const esp_vfs_fat_sdmmc_mount_config_t mount_config = {
// #ifdef CONFIG_BSP_SD_FORMAT_ON_MOUNT_FAIL
//         .format_if_mount_failed = true,
// #else
//         .format_if_mount_failed = false,
// #endif
        .format_if_mount_failed = true,
        .max_files = 16,
        .allocation_unit_size = 64 * 1024,
    };

    sdmmc_host_t host = SDMMC_HOST_DEFAULT();
    host.slot = SDMMC_HOST_SLOT_0;
    host.max_freq_khz = SDMMC_FREQ_HIGHSPEED;

    if (!sd_pwr_ctrl_init) {
        sd_pwr_ctrl_init = true;
        sd_pwr_ctrl_ldo_config_t ldo_config = {
            .ldo_chan_id = 4,
        };
        esp_err_t ret = sd_pwr_ctrl_new_on_chip_ldo(&ldo_config, &sd_pwr_ctrl_handle);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to create a new on-chip LDO power control driver");
        }
        vTaskDelay(pdMS_TO_TICKS(100));
    }
    
    host.pwr_ctrl_handle = sd_pwr_ctrl_handle;
    const sdmmc_slot_config_t slot_config = {
        /* SD card is connected to Slot 0 pins. Slot 0 uses IO MUX, so not specifying the pins here */
        .cd = SDMMC_SLOT_NO_CD,
        .wp = SDMMC_SLOT_NO_WP,
        .width = 4,
        .flags = 0,
    };

    esp_err_t ret = esp_vfs_fat_sdmmc_mount(BSP_SD_MOUNT_POINT, &host, &slot_config, &mount_config, &bsp_sdcard);

    // Reduce signal overshoot
    gpio_set_drive_capability(BSP_SD_CLK, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_SD_CMD, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_SD_D0, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_SD_D1, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_SD_D2, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_SD_D3, GPIO_DRIVE_CAP_1);

    return ret;
}

esp_err_t bsp_sdcard_unmount(void)
{
    return esp_vfs_fat_sdcard_unmount(BSP_SD_MOUNT_POINT, bsp_sdcard);
}

esp_err_t bsp_spiffs_mount(void)
{
    esp_vfs_spiffs_conf_t conf = {
        .base_path = CONFIG_BSP_SPIFFS_MOUNT_POINT,
        .partition_label = CONFIG_BSP_SPIFFS_PARTITION_LABEL,
        .max_files = CONFIG_BSP_SPIFFS_MAX_FILES,
#ifdef CONFIG_BSP_SPIFFS_FORMAT_ON_MOUNT_FAIL
        .format_if_mount_failed = true,
#else
        .format_if_mount_failed = false,
#endif
    };

    esp_err_t ret_val = esp_vfs_spiffs_register(&conf);

    BSP_ERROR_CHECK_RETURN_ERR(ret_val);

    size_t total = 0, used = 0;
    ret_val = esp_spiffs_info(conf.partition_label, &total, &used);
    if (ret_val != ESP_OK) {
        ESP_LOGE(TAG, "Failed to get SPIFFS partition information (%s)", esp_err_to_name(ret_val));
    } else {
        ESP_LOGI(TAG, "Partition size: total: %d, used: %d", total, used);
    }

    return ret_val;
}

esp_err_t bsp_spiffs_unmount(void)
{
    return esp_vfs_spiffs_unregister(CONFIG_BSP_SPIFFS_PARTITION_LABEL);
}

esp_err_t bsp_audio_init(const i2s_std_config_t *i2s_adc_config, const i2s_std_config_t *i2s_dac_config)
{
    if (i2s_tx_chan && i2s_rx_chan) {
        /* Audio was initialized before */
        return ESP_OK;
    }

    /* Setup I2S peripheral */
    i2s_chan_config_t chan_cfg_dac = I2S_CHANNEL_DEFAULT_CONFIG(0, I2S_ROLE_MASTER);
    chan_cfg_dac.auto_clear = true; // Auto clear the legacy data in the DMA buffer
    ESP_ERROR_CHECK(i2s_new_channel(&chan_cfg_dac, &i2s_tx_chan, NULL));

    // Reduce signal overshoot
    gpio_set_drive_capability(BSP_DAC_I2S_MCLK, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_DAC_I2S_SCLK, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_DAC_I2S_LRLK, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_DAC_I2S_SDOUT, GPIO_DRIVE_CAP_1);

    i2s_chan_config_t chan_cfg_adc = I2S_CHANNEL_DEFAULT_CONFIG(1, I2S_ROLE_MASTER);
    ESP_ERROR_CHECK(i2s_new_channel(&chan_cfg_adc, NULL, &i2s_rx_chan));

    // Reduce signal overshoot
    gpio_set_drive_capability(BSP_ADC_I2S_MCLK, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_ADC_I2S_SCLK, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_ADC_I2S_LRLK, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_ADC_I2S_SDIN, GPIO_DRIVE_CAP_1);

    /* Setup I2S channels */
    const i2s_std_config_t std_cfg_dav_default = BSP_I2S_DAC_DUPLEX_MONO_CFG(16000);
    const i2s_std_config_t *p_i2s_dac_cfg = &std_cfg_dav_default;

    const i2s_std_config_t std_cfg_adc_default = BSP_I2S_ADC_DUPLEX_MONO_CFG(16000);
    const i2s_std_config_t *p_i2s_adc_cfg = &std_cfg_adc_default;
    
    if (i2s_dac_config != NULL) {
        p_i2s_dac_cfg = i2s_dac_config;
    }

    if (i2s_adc_config != NULL) {
        p_i2s_adc_cfg = i2s_adc_config;
    }

    if (i2s_tx_chan != NULL) {
        ESP_ERROR_CHECK(i2s_channel_init_std_mode(i2s_tx_chan, p_i2s_dac_cfg));
        ESP_ERROR_CHECK(i2s_channel_enable(i2s_tx_chan));
    }

    i2s_tdm_config_t tdm_cfg = {
        .clk_cfg =
            {
                .sample_rate_hz  = (uint32_t)16000,
                .clk_src         = I2S_CLK_SRC_DEFAULT,
                .ext_clk_freq_hz = 0,
                .mclk_multiple   = I2S_MCLK_MULTIPLE_256,
                .bclk_div        = 8,
            },
        .slot_cfg = {
                        .data_bit_width = I2S_DATA_BIT_WIDTH_16BIT,
                        .slot_bit_width = I2S_SLOT_BIT_WIDTH_AUTO,
                        .slot_mode      = I2S_SLOT_MODE_STEREO,
                        .slot_mask      = (I2S_TDM_SLOT0 | I2S_TDM_SLOT1 | I2S_TDM_SLOT2 | I2S_TDM_SLOT3),
                        .ws_width       = I2S_TDM_AUTO_WS_WIDTH,
                        .ws_pol         = false,
                        .bit_shift      = true,
                        .left_align     = false,
                        .big_endian     = false,
                        .bit_order_lsb  = false,
                        .skip_mask      = false,
                        .total_slot     = I2S_TDM_AUTO_SLOT_NUM
                    },
        .gpio_cfg = BSP_I2S_ADC_GPIO_CFG,
    };

