metaneutrons/Vellum/firmware-d1001/components/esp32_p4_re_terminal_d1001/src/esp32_p4_re_terminal_d1001.c
    // if (i2s_rx_chan != NULL) {
    //     ESP_ERROR_CHECK(i2s_channel_init_std_mode(i2s_rx_chan, p_i2s_adc_cfg));
    //     ESP_ERROR_CHECK(i2s_channel_enable(i2s_rx_chan));
    // }

    if (i2s_rx_chan != NULL) {
        ESP_ERROR_CHECK(i2s_channel_init_tdm_mode(i2s_rx_chan, &tdm_cfg));
        ESP_ERROR_CHECK(i2s_channel_enable(i2s_rx_chan));
    }

    audio_codec_i2s_cfg_t i2s_cfg_dac = {
        .port = I2S_NUM_0,
        .rx_handle = NULL,
        .tx_handle = i2s_tx_chan,
    };
    i2s_dac_data_if = audio_codec_new_i2s_data(&i2s_cfg_dac);

    audio_codec_i2s_cfg_t i2s_cfg_adc = {
        .port = I2S_NUM_1,
        .rx_handle = i2s_rx_chan,
        .tx_handle = NULL,
    };
    i2s_adc_data_if = audio_codec_new_i2s_data(&i2s_cfg_adc);

    return ESP_OK;
}

esp_codec_dev_handle_t bsp_audio_codec_speaker_init(void)
{
    if (i2s_dac_data_if == NULL) {
        /* Configure I2S peripheral and Power Amplifier */
        ESP_ERROR_CHECK(bsp_audio_init(NULL, NULL));
    }
    assert(i2s_dac_data_if);

    const audio_codec_gpio_if_t *gpio_if = audio_codec_new_gpio();

    audio_codec_i2c_cfg_t i2c_cfg = {
        .port = 1,
        .addr = ES8311_CODEC_DEFAULT_ADDR,
        .bus_handle = i2c_1_handle,
    };
    const audio_codec_ctrl_if_t *i2c_ctrl_if = audio_codec_new_i2c_ctrl(&i2c_cfg);
    assert(i2c_ctrl_if);

    esp_codec_dev_hw_gain_t gain = {
        .pa_voltage = 5.0,
        .codec_dac_voltage = 3.3,
    };

    es8311_codec_cfg_t es8311_cfg = {
        .ctrl_if = i2c_ctrl_if,
        .gpio_if = gpio_if,
        .codec_mode = ESP_CODEC_DEV_TYPE_OUT,
        // .pa_pin = -1,
        .pa_pin = GPIO_NUM_53,
        .pa_reverted = false,
        .master_mode = false,
        .use_mclk = true,
        .digital_mic = false,
        .invert_mclk = false,
        .invert_sclk = false,
        .hw_gain = gain,
    };
    const audio_codec_if_t *es8311_dev = es8311_codec_new(&es8311_cfg);
    assert(es8311_dev);

    esp_codec_dev_cfg_t codec_dev_cfg = {
        .dev_type = ESP_CODEC_DEV_TYPE_OUT,
        .codec_if = es8311_dev,
        .data_if = i2s_dac_data_if,
    };
    return esp_codec_dev_new(&codec_dev_cfg);
}

esp_codec_dev_handle_t bsp_audio_codec_microphone_init(void)
{
    if (i2s_adc_data_if == NULL) {
        /* Configure I2S peripheral and Power Amplifier */
        ESP_ERROR_CHECK(bsp_audio_init(NULL, NULL));
    }
    assert(i2s_adc_data_if);

    audio_codec_i2c_cfg_t i2c_cfg = {
        .port = 1,
        .addr = ES7210_CODEC_DEFAULT_ADDR,
        .bus_handle = i2c_1_handle,
    };
    const audio_codec_ctrl_if_t *i2c_ctrl_if = audio_codec_new_i2c_ctrl(&i2c_cfg);
    assert(i2c_ctrl_if);

    es7210_codec_cfg_t es7210_cfg = {
        .ctrl_if = i2c_ctrl_if,
        .mic_selected = ES7120_SEL_MIC1 | ES7120_SEL_MIC2 | ES7120_SEL_MIC3 | ES7120_SEL_MIC4,
    };
    const audio_codec_if_t *es7210_dev = es7210_codec_new(&es7210_cfg);
    assert(es7210_dev);

    esp_codec_dev_cfg_t codec_dev_cfg = {
        .dev_type = ESP_CODEC_DEV_TYPE_IN,
        .codec_if = es7210_dev,
        .data_if = i2s_adc_data_if,
    };
    return esp_codec_dev_new(&codec_dev_cfg);
}

// Bit number used to represent command and parameter
#define LCD_LEDC_CH            CONFIG_BSP_DISPLAY_BRIGHTNESS_LEDC_CH

esp_err_t bsp_display_brightness_init(void)
{
    // Setup LEDC peripheral for PWM backlight control
    const ledc_timer_config_t LCD_backlight_timer = {
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .duty_resolution = LEDC_TIMER_10_BIT,
        .timer_num = 1,
        .freq_hz = 1000,
        .clk_cfg = LEDC_AUTO_CLK
    };
    const ledc_channel_config_t LCD_backlight_channel = {
        .gpio_num = BSP_LCD_BACKLIGHT,
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .channel = LCD_LEDC_CH,
        .intr_type = LEDC_INTR_DISABLE,
        .timer_sel = 1,
        .duty = 0,
        .hpoint = 0
    };
    const ledc_channel_config_t RGB_red_channel = {
        .gpio_num = BSP_LED_R,
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .channel = 2,
        .intr_type = LEDC_INTR_DISABLE,
        .timer_sel = 1,
        .duty = 100,
        .hpoint = 0
    };
    const ledc_channel_config_t RGB_green_channel = {
        .gpio_num = BSP_LED_G,
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .channel = 3,
        .intr_type = LEDC_INTR_DISABLE,
        .timer_sel = 1,
        .duty = 100,
        .hpoint = 0
    };
    const ledc_channel_config_t RGB_blue_channel = {
        .gpio_num = BSP_LED_B,
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .channel = 4,
        .intr_type = LEDC_INTR_DISABLE,
        .timer_sel = 1,
        .duty = 100,
        .hpoint = 0
    };
    BSP_ERROR_CHECK_RETURN_ERR(ledc_timer_config(&LCD_backlight_timer));
    BSP_ERROR_CHECK_RETURN_ERR(ledc_channel_config(&LCD_backlight_channel));
    BSP_ERROR_CHECK_RETURN_ERR(ledc_channel_config(&RGB_red_channel));
    BSP_ERROR_CHECK_RETURN_ERR(ledc_channel_config(&RGB_green_channel));
    BSP_ERROR_CHECK_RETURN_ERR(ledc_channel_config(&RGB_blue_channel));
    brightness_init = true;
    return ESP_OK;
}

esp_err_t bsp_display_brightness_set(int brightness_percent)
{
    if (brightness_init) {
        if (brightness_percent > 100) {
            brightness_percent = 100;
        }
        if (brightness_percent < 0) {
            brightness_percent = 0;
        }
        if (brightness_percent) {
            backlight_default = brightness_percent;
        }
        
        ESP_LOGD(TAG, "Setting LCD backlight: %d%%", brightness_percent);
        uint32_t duty_cycle = (1023 * brightness_percent) / 100; // LEDC resolution set to 10bits, thus: 100% = 1023
        BSP_ERROR_CHECK_RETURN_ERR(ledc_set_duty(LEDC_LOW_SPEED_MODE, LCD_LEDC_CH, duty_cycle));
        BSP_ERROR_CHECK_RETURN_ERR(ledc_update_duty(LEDC_LOW_SPEED_MODE, LCD_LEDC_CH));
        return ESP_OK;
    } else {
        return ESP_FAIL;
    }
}

esp_err_t bsp_display_backlight_off(void)
{
    return bsp_display_brightness_set(0);
}

esp_err_t bsp_display_backlight_on(void)
{
    return bsp_display_brightness_set(backlight_default);
}

esp_err_t bsp_rgb_led_duty_set(uint8_t rgb, int percent)
{
    char str[4] = {'r','g','b',0};
    if(rgb > 2) return ESP_FAIL;
    if (brightness_init) {
        if (percent > 100) {
            percent = 100;
        }
        if (percent < 0) {
            percent = 0;
        }

