metaneutrons/Vellum/firmware-d1001/components/esp32_p4_re_terminal_d1001/src/esp32_p4_re_terminal_d1001.c
    const lvgl_port_display_dsi_cfg_t dpi_cfg = {
        .flags = {
#if CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR
            .avoid_tearing = true,
#else
            .avoid_tearing = false,
#endif
        }
    };

    return lvgl_port_add_disp_dsi(&disp_cfg, &dpi_cfg);
}

static lv_indev_t *bsp_display_indev_init(lv_display_t *disp)
{
    esp_lcd_touch_handle_t tp;
    BSP_ERROR_CHECK_RETURN_NULL(bsp_touch_new(NULL, &tp));
    assert(tp);

    /* Add touch input (for selected screen) */
    const lvgl_port_touch_cfg_t touch_cfg = {
        .disp = disp,
        .handle = tp,
    };

    return lvgl_port_add_touch(&touch_cfg);
}

lv_display_t *bsp_display_start(void)
{
    bsp_display_cfg_t cfg = {
        .lvgl_port_cfg = ESP_LVGL_PORT_INIT_CONFIG(),
        .buffer_size = BSP_LCD_DRAW_BUFF_SIZE,
        .double_buffer = BSP_LCD_DRAW_BUFF_DOUBLE,
        .flags = {
#if CONFIG_BSP_LCD_COLOR_FORMAT_RGB888
            .buff_dma = false,
#else
            .buff_dma = true,
#endif
            .buff_spiram = false,
            .sw_rotate = true,
        }
    };
    return bsp_display_start_with_config(&cfg);
}

lv_display_t *bsp_display_start_with_config(const bsp_display_cfg_t *cfg)
{
    lv_display_t *disp;

    assert(cfg != NULL);
    BSP_ERROR_CHECK_RETURN_NULL(lvgl_port_init(&cfg->lvgl_port_cfg));

    BSP_ERROR_CHECK_RETURN_NULL(bsp_display_brightness_init());

    BSP_NULL_CHECK(disp = bsp_display_lcd_init(cfg), NULL);

    BSP_NULL_CHECK(disp_indev = bsp_display_indev_init(disp), NULL);

    return disp;
}

lv_indev_t *bsp_display_get_input_dev(void)
{
    return disp_indev;
}

void bsp_display_rotate(lv_display_t *disp, lv_disp_rotation_t rotation)
{
    lv_disp_set_rotation(disp, rotation);
}

bool bsp_display_lock(uint32_t timeout_ms)
{
    return lvgl_port_lock(timeout_ms);
}

void bsp_display_unlock(void)
{
    lvgl_port_unlock();
}

#endif // (BSP_CONFIG_NO_GRAPHIC_LIB == 0)

static esp_err_t bsp_adc_init(void)
{
    esp_err_t ret = ESP_OK;

    if( adc_initialized == false ) {
        adc_initialized = true;

        adc_oneshot_unit_init_cfg_t adc_config = {
            .unit_id  = ADC_UNIT_1,
            .ulp_mode = ADC_ULP_MODE_DISABLE,
        };

        ret = adc_oneshot_new_unit(&adc_config, &adc_1_handle);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "adc add new fail");
            return ESP_FAIL;
        }

        adc_oneshot_chan_cfg_t chan_config = {
            .atten    = ADC_ATTEN_DB_12,
            .bitwidth = ADC_BITWIDTH_12,
        };

        ret = adc_oneshot_config_channel(adc_1_handle, ADC_CHANNEL_1, &chan_config);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "adc config chan 1 fail");
            return ESP_FAIL;
        }

        ret = adc_oneshot_config_channel(adc_1_handle, ADC_CHANNEL_2, &chan_config);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "adc config chan 2 fail");
            return ESP_FAIL;
        }

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
        adc_cali_curve_fitting_config_t cali_config_1 = {
                .unit_id = ADC_UNIT_1,
                .chan = ADC_CHANNEL_1,
                .atten = ADC_ATTEN_DB_12,
                .bitwidth = ADC_BITWIDTH_12,
        };
        ret = adc_cali_create_scheme_curve_fitting(&cali_config_1, &adc_1_cali_chan_1_handle);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "adc cali create chan 1 fail");
            return ESP_FAIL;
        }

        adc_cali_curve_fitting_config_t cali_config_2 = {
                .unit_id = ADC_UNIT_1,
                .chan = ADC_CHANNEL_2,
                .atten = ADC_ATTEN_DB_12,
                .bitwidth = ADC_BITWIDTH_12,
        };
        ret = adc_cali_create_scheme_curve_fitting(&cali_config_2, &adc_1_cali_chan_2_handle);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "adc cali create chan 2 fail");
            return ESP_FAIL;
        }
#endif
    }

    return ESP_OK;
}

static int bsp_adc_read(adc_channel_t channel)
{
    int voltage = 0;
    uint32_t sum = 0;
    int volt_temp = 0;
    uint16_t temp_val = 0;

    for (uint16_t i = 0; i < ADC_SAMPLE_NUM; i++) {
        adc_raw_data[i] = 0;
    }
    for (uint16_t i = 0; i < ADC_SAMPLE_NUM; i++) {
        adc_oneshot_read(adc_1_handle, channel, &adc_raw_data[i]);
    }

    for (uint16_t i = 0; i < ADC_SAMPLE_NUM - 1; i++) {
        for (uint16_t j = i + 1; j < ADC_SAMPLE_NUM; j++) {
            if (adc_raw_data[i] > adc_raw_data[j]) {
                temp_val = adc_raw_data[i];
                adc_raw_data[i] = adc_raw_data[j];
                adc_raw_data[j] = temp_val;
            }
        }
    }
    for (uint16_t i = AD_LOST_VAL; i < ADC_SAMPLE_NUM - AD_LOST_VAL; i++) {
        sum += adc_raw_data[i];
    }
    volt_temp = sum / (ADC_SAMPLE_NUM - 2 * AD_LOST_VAL);
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    if (channel == ADC_CHANNEL_1) {
        adc_cali_raw_to_voltage(adc_1_cali_chan_1_handle, volt_temp, &voltage);
    } else if (channel == ADC_CHANNEL_2) {
        adc_cali_raw_to_voltage(adc_1_cali_chan_2_handle, volt_temp, &voltage);
    }
#else
    voltage = volt_temp;
#endif

    return voltage;
}

int bsp_battery_voltage_read(void)
{
    return bsp_bat_volt;
}

static uint8_t vol_to_percentage(uint16_t voltage)
{
    if (voltage < battery_level_percent_table[0]) {
        return 0;
    }

    for (uint8_t i = 0; i < BATTERY_POINT; i++) {
        if (voltage < battery_level_percent_table[i]) {
            return (i - 1) * PERCENT_STEP_MIN + (PERCENT_STEP_MIN * (int)(voltage - battery_level_percent_table[i-1])) / 
                (int)(battery_level_percent_table[i] - battery_level_percent_table[i-1]);
        }
    }

    return 100;
}

int bsp_battery_percent_read(void)
{
    uint8_t per = vol_to_percentage(bsp_bat_volt);
    if (per == 0) {
        return 0;
    } else if (per > 0 && per < 5) {
        return 1;
    } else {
        return (per / 5) * 5;
    }
}

int bsp_usb_voltage_read(void)
{
    return bsp_usb_volt;
}

bool bsp_battery_charge_status_read(void)
{
    int status = 0;
    status = gpio_get_level(BSP_BAT_CHARGE_STATE);
    return (status? false : true);
}

static bool bsp_chg_error = false;
static uint32_t chg_high_ms = 0;
static uint32_t chg_low_ms = 0;

static void charge_status_isr_handler(void* arg)
{
    int status = gpio_get_level(BSP_BAT_CHARGE_STATE);
    if (status) {
        chg_high_ms = (uint32_t)(esp_timer_get_time() / 1000);
    } else {
        chg_low_ms = (uint32_t)(esp_timer_get_time() / 1000);
    }
    if (chg_high_ms && chg_low_ms && (chg_high_ms - chg_low_ms) < 2000) {
        bsp_chg_error = true;
    }
}

static void bsp_battery_charge_en(bool en)
{
    if (en) {
        if (!bat_chg_state) {
            bat_chg_state = true;
            esp_io_expander_set_level(io_expander, BSP_BAT_CHARGE_EN, 0); // enable battery charge
        }
    } else {
        if (bat_chg_state) {
            bat_chg_state = false;
            esp_io_expander_set_level(io_expander, BSP_BAT_CHARGE_EN, 1); // disable battery charge
        }
    }
}

#define VOLT_AVG_MAX    60
static void bsp_battery_charge_task(void *arg)
{
    uint8_t log_err_cnt = 0;
    int bsp_usb_volt_cur = 0;
    int bsp_bat_volt_cur = 0;
    int volt[VOLT_AVG_MAX] = { 0 }, index = 0, count = 0; 
    int32_t volt_sum = 0, volt_avg = 0;
    while (1) {
        bsp_usb_volt = bsp_adc_read(ADC_CHANNEL_1) * 2;
        bsp_bat_volt_cur = bsp_adc_read(ADC_CHANNEL_2) * 2;

        volt[index ++] = bsp_bat_volt_cur;
        if (index >= VOLT_AVG_MAX) {
            index = 0;
        }
        if (count < VOLT_AVG_MAX) {
            count ++;
        }
        volt_sum = 0;
        for (int16_t i = 0; i < count; i++) {
            volt_sum += volt[i];
        }
        volt_avg = volt_sum / count;
        bsp_bat_volt_cur = volt_avg;

