metaneutrons/Vellum/firmware-d1001/components/esp32_p4_re_terminal_d1001/src/esp32_p4_re_terminal_d1001.c
        if (bsp_bat_volt == 0) {
            bsp_bat_volt = bsp_bat_volt_cur;
        }

        if (bsp_bat_volt_cur > CHARGE_VOLT_HIGH) {
            if (bat_chg_state) {
                bsp_battery_charge_en(false);
                ESP_LOGW(TAG, "battery high, disable charge");
            }
        } else if (bsp_bat_volt_cur < CHARGE_VOLT_LOW) {
            if (!bat_chg_state) {
                bsp_battery_charge_en(true);
                ESP_LOGW(TAG, "battery low, enable charge");
            }
        } else {
            if (abs(bsp_usb_volt - bsp_usb_volt_cur) > 2000)
            {
                bsp_usb_volt_cur = bsp_usb_volt;
                if (bsp_usb_volt > 2000) {
                    bsp_battery_charge_en(true);
                    ESP_LOGW(TAG, "usb insert, enable charge");
                }
            }
        }        

        if (bsp_usb_volt > 4000) {
            bsp_bat_volt = bsp_bat_volt_cur;
            if (!bsp_chg_error) {
                log_err_cnt = 0;
                int charge = gpio_get_level(BSP_BAT_CHARGE_STATE);
                if (charge) {
                    // high: charge done
                } else {
                    // low: charging
                }
            } else {
                bsp_chg_error = false;
                log_err_cnt ++;
                if (log_err_cnt >= 5) {
                    log_err_cnt = 0;
                    ESP_LOGE(TAG, "battery charge error!!!");
                }
            }
        } else {
            if (bsp_bat_volt_cur < bsp_bat_volt) {
                bsp_bat_volt = bsp_bat_volt_cur;
            }
        }

#if BSP_BATTERY_CHARGE_PROTECT
        float temp = 0;
        bsp_lsm6ds3_read_temp(&lsm6ds3, &temp);
        if (temp <= BSP_BATTERY_CHARGE_TEMP_MAX && temp >= BSP_BATTERY_CHARGE_TEMP_MIN) {
            bsp_battery_charge_en(true);
            
        } else {
            bsp_battery_charge_en(false);
        }
#endif

        vTaskDelay(pdMS_TO_TICKS(1000));
        bsp_boot_count += 1;
    }
}

esp_err_t bsp_battery_manage_start(void)
{
    esp_err_t ret = ESP_OK;
    if (!battery_task_init) {
        battery_task_init = true;

        const gpio_config_t int_gpio_config = {
            .pull_up_en = 1,
            .pull_down_en = 0,
            .mode = GPIO_MODE_INPUT,
            .intr_type = GPIO_INTR_ANYEDGE,
            .pin_bit_mask = 1ULL << BSP_BAT_CHARGE_STATE,
        };
        ret = gpio_config(&int_gpio_config);
        gpio_install_isr_service(ESP_INTR_FLAG_IRAM);
        gpio_isr_handler_add(BSP_BAT_CHARGE_STATE, charge_status_isr_handler, (void *)BSP_BAT_CHARGE_STATE);

        gpio_config_t io_in_conf = {
            .pull_up_en = 1,
            .pull_down_en = 0,
            .mode = GPIO_MODE_INPUT,
            .intr_type = GPIO_INTR_DISABLE,
        };
        io_in_conf.pin_bit_mask = 1ULL << BSP_BAT_VSYS_PG,
        gpio_config(&io_in_conf);

        if (xTaskCreate(bsp_battery_charge_task, "bat_mng", 3072, NULL, 1, &battery_manage_task) != pdTRUE) {
            ESP_LOGE(TAG, "Creating battery manage task failed");
            abort();
        }
    }

    return ESP_OK;
}

static void bsp_sdcard_detect_isr_handler(void* arg)
{
    int status = gpio_get_level(BSP_SD_DETECT); // high: remove, low: insert
    if (status) {
        sd_card_insert = false;
    } else {
        sd_card_insert = true;
    }
    if (sd_card_m_task_handle) {
        xTaskNotifyGive(sd_card_m_task_handle);
    }
}

static void bsp_sd_card_auto_mount_task(void *arg)
{
    esp_err_t ret = ESP_OK;
    while (1) {
        ulTaskNotifyTake( pdTRUE, portMAX_DELAY );
        if (sd_card_insert) {
            if (!sd_mount_flag) {
                ret = bsp_sdcard_mount();
                if (ret != ESP_OK) {
                    sd_mount_flag = false;
                    ESP_LOGE(TAG, "bsp sdcard mount fail");
                } else {
                    sd_mount_flag = true;
                    ESP_LOGW(TAG, "bsp sdcard mount ok");
                }
            }
        } else {
            if (sd_mount_flag) {
                ret = bsp_sdcard_unmount();
                if (ret != ESP_OK) {
                    sd_mount_flag = true;
                    ESP_LOGE(TAG, "bsp sdcard unmount fail");
                } else {
                    sd_mount_flag = false;
                    ESP_LOGW(TAG, "bsp sdcard unmount ok");
                }
            }
        }
    }
}

esp_err_t bsp_sd_card_manage_start(bool cmd)
{
    esp_err_t ret = ESP_OK;

    const gpio_config_t int_gpio_config = {
        .pull_up_en = 0,
        .pull_down_en = 0,
        .mode = GPIO_MODE_INPUT,
        .intr_type = GPIO_INTR_ANYEDGE,
        .pin_bit_mask = 1ULL << BSP_SD_DETECT,
    };
    ret = gpio_config(&int_gpio_config);
    gpio_install_isr_service(ESP_INTR_FLAG_IRAM);
    gpio_isr_handler_add(BSP_SD_DETECT, bsp_sdcard_detect_isr_handler, (void *)BSP_SD_DETECT);

    if (cmd) {
        if (gpio_get_level(BSP_SD_DETECT) == 0) {
            sd_card_insert = true;
            ret = bsp_sdcard_mount();
            if (ret == ESP_OK) {
                sd_mount_flag = true;
                ESP_LOGW(TAG, "bsp sdcard mount ok");
            } else {
                sd_mount_flag = false;
                ESP_LOGE(TAG, "bsp sdcard mount fail");
            }
        }
    }

    xTaskCreate(bsp_sd_card_auto_mount_task, "sd-card", 4096, NULL, 1, &sd_card_m_task_handle);

    return ret;
}

bool bsp_sd_card_get_mount_state(void)
{
    return sd_mount_flag;
}

bool bsp_backlight_get_enable_state(void)
{
    return backlight_enable;
}

static void bsp_button_single_click_event_cb(void *arg, void *data)
{
    esp_err_t ret = ESP_OK;
    if (bsp_boot_count > 6) { // Prevent accidental triggering during startup
        if (backlight_enable) {
            backlight_enable = false;
            bsp_display_brightness_set(0);
            ESP_LOGI(TAG, "display brightness: 0");
            if (disp_panel) {
                ret = esp_lcd_panel_disp_on_off(disp_panel, false);
                if (ret == ESP_OK) {
                    ESP_LOGI(TAG, "display panel trun off");
                }
            }
        } else {
            backlight_enable = true;
            bsp_display_brightness_set(backlight_default);
            ESP_LOGI(TAG, "display brightness: %d", backlight_default);
            if (disp_panel) {
                ret = esp_lcd_panel_disp_on_off(disp_panel, true);
                if (ret == ESP_OK) {
                    ESP_LOGI(TAG, "display panel trun on");
                }
            }
        }
    }
}

static void bsp_button_long_press_event_cb(void *arg, void *data)
{
    // TODO
    // need to save some data on here

