metaneutrons/Vellum/firmware-d1001/components/esp32_p4_re_terminal_d1001/src/esp32_p4_re_terminal_d1001.c
    ESP_LOGI(TAG, "system power off");
    vTaskDelay(pdMS_TO_TICKS(500));
    esp_io_expander_set_level(io_expander, BSP_LTE_PWR_EN, 0); // need trun off lte power first
    vTaskDelay(pdMS_TO_TICKS(500));
    esp_io_expander_set_level(io_expander, BSP_PWR_HOLD, 0);
}

void bsp_led_red_set(bool cmd)
{
    // gpio_set_level(BSP_LED_R, cmd? false : true);
    if(cmd) bsp_rgb_led_duty_set(0, LED_RED_DC_DEF);
    else bsp_rgb_led_duty_set(0, 0);
}

void bsp_led_green_set(bool cmd)
{
    // gpio_set_level(BSP_LED_G, cmd? false : true);
    if(cmd) bsp_rgb_led_duty_set(1, LED_GREEN_DC_DEF);
    else bsp_rgb_led_duty_set(1, 0);
}

void bsp_led_blue_set(bool cmd)
{
    // gpio_set_level(BSP_LED_B, cmd? false : true);
    if(cmd) bsp_rgb_led_duty_set(2, LED_BLUE_DC_DEF);
    else bsp_rgb_led_duty_set(2, 0);
}

void bsp_power_off(void)
{
    vTaskDelay(pdMS_TO_TICKS(500));
    esp_io_expander_set_level(io_expander, BSP_LTE_PWR_EN, 0); // need trun off lte power first
    vTaskDelay(pdMS_TO_TICKS(500));
    esp_io_expander_set_level(io_expander, BSP_PWR_HOLD, 0);
}

esp_err_t bsp_power_init(void)
{
    SET_PERI_REG_BITS(PMU_HP_ACTIVE_BIAS_REG, PMU_HP_ACTIVE_DCM_VSET, 26, PMU_HP_ACTIVE_DCM_VSET_S);

    vTaskDelay(pdMS_TO_TICKS(1000));

    /* Initilize I2C */
    BSP_ERROR_CHECK_RETURN_ERR(bsp_i2c_0_init());
    BSP_ERROR_CHECK_RETURN_ERR(bsp_i2c_1_init());
    BSP_ERROR_CHECK_RETURN_ERR(bsp_adc_init());

    /* Initilize IO expander */
    esp_err_t ret = ESP_OK;
    ret = esp_io_expander_new_i2c_pca9535(i2c_1_handle, ESP_IO_EXPANDER_I2C_PCA9535_ADDRESS_000, &io_expander);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "io expander init fail");
        BSP_ERROR_CHECK_RETURN_ERR(ret);
    } else {
        ESP_LOGI(TAG, "io expander init ok");
    }
    esp_io_expander_set_dir(io_expander, 0xffff, IO_EXPANDER_OUTPUT);

    esp_io_expander_set_level(io_expander, BSP_PWR_HOLD, 1); // turn on vdd_3v3
    vTaskDelay(pdMS_TO_TICKS(50));

    esp_io_expander_set_level(io_expander, BSP_LCD_BACKLIGHT_EN, 1); // turn on backlight power
    esp_io_expander_set_level(io_expander, BPS_LCD_PWR_EN, 1); // turn on display power
    vTaskDelay(pdMS_TO_TICKS(50));
    esp_io_expander_set_level(io_expander, BSP_LCD_RST, 1);

    esp_io_expander_set_level(io_expander, BSP_CAM_EN, 1); // turn on camera power
    vTaskDelay(pdMS_TO_TICKS(50));
    esp_io_expander_set_level(io_expander, BSP_CAM_PWDN, 1); // 
    esp_io_expander_set_level(io_expander, BSP_CAM_RST, 1);
    vTaskDelay(pdMS_TO_TICKS(10));
    esp_io_expander_set_level(io_expander, BSP_CAM_RST, 0);
    vTaskDelay(pdMS_TO_TICKS(10));
    esp_io_expander_set_level(io_expander, BSP_CAM_RST, 1);
    vTaskDelay(pdMS_TO_TICKS(50));

    esp_io_expander_set_level(io_expander, BSP_LTE_PWR_EN, 1); // trun on lte power
    vTaskDelay(pdMS_TO_TICKS(50));
    esp_io_expander_set_level(io_expander, BSP_LTE_AIRPLANE_MODE, 1);
    esp_io_expander_set_level(io_expander, BSP_LTE_DTR, 1);
    esp_io_expander_set_level(io_expander, BSP_LTE_RESET, 1);
    vTaskDelay(pdMS_TO_TICKS(10));
    esp_io_expander_set_level(io_expander, BSP_LTE_RESET, 0);
    vTaskDelay(pdMS_TO_TICKS(10));
    esp_io_expander_set_level(io_expander, BSP_LTE_RESET, 1);
    vTaskDelay(pdMS_TO_TICKS(50));

    esp_io_expander_set_level(io_expander, BSP_BAT_READ_EN, 1); // turn on battery read
    esp_io_expander_set_level(io_expander, BSP_BAT_CHARGE_EN, 0); // 1: disable battery charge, 0: enable battery charge

    esp_io_expander_set_level(io_expander, BSP_POWER_AMP_EN, 1); // turn on amp power

    gpio_config_t io_in_conf = {
        .pull_up_en = 1,
        .pull_down_en = 0,
        .mode = GPIO_MODE_INPUT,
        .intr_type = GPIO_INTR_DISABLE,
    };

    io_in_conf.pin_bit_mask = 1ULL << BSP_BAT_CHARGE_STATE,
    gpio_config(&io_in_conf);

    gpio_config_t io_out_conf = {
        .mode = GPIO_MODE_OUTPUT,
    };

    // io_out_conf.pin_bit_mask = 1ULL << BSP_LED_R;
    // gpio_config(&io_out_conf);
    // gpio_set_level(BSP_LED_R, 0); // trun off led red

    // io_out_conf.pin_bit_mask = 1ULL << BSP_LED_G;
    // gpio_config(&io_out_conf);
    // gpio_set_level(BSP_LED_G, 0); // trun off led green

    // io_out_conf.pin_bit_mask = 1ULL << BSP_LED_B;
    // gpio_config(&io_out_conf);
    // gpio_set_level(BSP_LED_B, 0); // trun off led blue

    // Reduce signal overshoot
    gpio_set_drive_capability(BSP_WIFI_SDIO_CLK, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_WIFI_SDIO_CMD, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_WIFI_SDIO_D0, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_WIFI_SDIO_D1, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_WIFI_SDIO_D2, GPIO_DRIVE_CAP_1);
    gpio_set_drive_capability(BSP_WIFI_SDIO_D3, GPIO_DRIVE_CAP_1);

    io_in_conf.pull_up_en = 0;
    io_in_conf.pull_down_en = 0;
    io_in_conf.pin_bit_mask = 1ULL << BSP_WIFI_TXD0,
    gpio_config(&io_in_conf);
    io_in_conf.pin_bit_mask = 1ULL << BSP_WIFI_RXD0,
    gpio_config(&io_in_conf);
    io_in_conf.pin_bit_mask = 1ULL << BSP_WIFI_BOOT,
    gpio_config(&io_in_conf);

    // if (!sd_pwr_ctrl_init) {
    //     sd_pwr_ctrl_init = true;
    //     sd_pwr_ctrl_ldo_config_t ldo_config = {
    //         .ldo_chan_id = 4,
    //     };
    //     esp_err_t ret = sd_pwr_ctrl_new_on_chip_ldo(&ldo_config, &sd_pwr_ctrl_handle);
    //     if (ret != ESP_OK) {
    //         ESP_LOGE(TAG, "Failed to create a new on-chip LDO power control driver");
    //     }
    //     vTaskDelay(pdMS_TO_TICKS(100));
    // }
    bsp_sdcard_mount(); // trun on core_vdd_5

    io_out_conf.pin_bit_mask = 1ULL << BSP_SD_PWR_EN;
    gpio_config(&io_out_conf);
    gpio_set_level(BSP_SD_PWR_EN, 0); // power off sd card
    vTaskDelay(pdMS_TO_TICKS(100));
    gpio_set_level(BSP_SD_PWR_EN, 1); // power on sd card

    bsp_new_i2c_pcf8563(i2c_1_handle, PCF8563_I2C_ADDRESS, &pcf8563);
    bsp_new_i2c_lsm6ds3(i2c_1_handle, LSM6DS3_I2C_ADDRESS, &lsm6ds3);

    // rtc_datatime_t datetime = {
    //     .year = 2025, .month = 1, .day = 1,
    //     .hour = 0, .minute = 0, .second = 0,
    //     .week = 3,
    // };
    // ret = bsp_pcf8563_set_datatime(&pcf8563, &datetime);
    // BSP_ERROR_CHECK_RETURN_ERR(ret);

    ret = bsp_lsm6ds3_config_default(&lsm6ds3);
    // BSP_ERROR_CHECK_RETURN_ERR(ret);

    bsp_battery_manage_start();
    bsp_sd_card_manage_start(true);
    
    button_config_t btn_cfg = {0};
    button_gpio_config_t gpio_cfg = {
        .gpio_num = BSP_BUTTON_IN,
        .active_level = 1,
        .disable_pull = true,
        .enable_power_save = false,
    };
    button_handle_t bsp_btn;
    iot_button_new_gpio_device(&btn_cfg, &gpio_cfg, &bsp_btn);
    iot_button_set_param(bsp_btn, BUTTON_SHORT_PRESS_TIME_MS, (void *)100);
    iot_button_set_param(bsp_btn, BUTTON_LONG_PRESS_TIME_MS, (void *)3000);
    iot_button_register_cb(bsp_btn, BUTTON_SINGLE_CLICK, NULL, bsp_button_single_click_event_cb, NULL);
    iot_button_register_cb(bsp_btn, BUTTON_LONG_PRESS_HOLD, NULL, bsp_button_long_press_event_cb, NULL);

    return ESP_OK;
}
